Revit 2026 API

# ViewDisplaySketchyLines Class

---

Represents the settings for sketchy lines.

SystemObject Autodesk.Revit.DBViewDisplaySketchyLines

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewDisplaySketchyLines : IDisposable
```
```vb
Public Class ViewDisplaySketchyLines
	Implements IDisposable
```
```cpp
public ref class ViewDisplaySketchyLines : IDisposable
```
```fsharp
type ViewDisplaySketchyLines =
    class
        interface IDisposable
    end
```

The ViewDisplaySketchyLines type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnableSketchyLines | True to enable sketchy lines visibility. False to disable it. |
|  | Extension | The extension scale value. Controls the magnitude of line's extension. Values between 0 and 10. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Jitter | The jitter defines jitteriness of the line. Values between 0 and 10. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ViewDisplaySketchyLines |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace